# ElementLevelFilter Constructor (ElementId)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementLevelFilter Constructor (ElementId)
ElementLevelFilter Class See Also
---
Constructs a new instance of an ElementLevelFilter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementLevelFilter(
	ElementId levelId
)
```

Visual Basic
---
```text
Public Sub New ( _
	levelId As ElementId _
)
```

Visual C++
---
```text
public:
ElementLevelFilter(
	ElementId^ levelId
)
```

# ### Parameters
levelId
    Type: Autodesk.Revit.DB..::..ElementId The id of the level that will be matched to elements' associated level.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ElementLevelFilter Class
ElementLevelFilter Overload
Autodesk.Revit.DB Namespace